export default {
    usertag: /^[a-z0-9_]{3,32}$/,
    mobile: /^\+?[1-9]\d{1,14}$/,
    email: /^[^\s@]+@[^\s@]+\.[^\s@]+$/,
    password: {
        lengthmin: /^.{8,}$/,
        lengthmax: /^.{0,32}$/,
        lowercase: /^(?=.*[a-z]).{8,32}$/,
        uppercase: /^(?=.*[A-Z]).{8,32}$/,
        digit: /^(?=.*\d).{8,32}$/,
        special: /^(?=.*[!@#$%^&*]).{8,32}$/,
    },
    fullname: /^[a-zA-ZàáâäãåąčćęèéêëėįìíîïłńòóôöõøùúûüųūÿýżźñçčšžÀÁÂÄÃÅĄČĆĘÈÉÊËĖĮÌÍÎÏŁŃÒÓÔÖÕØÙÚÛÜŲŪŸÝŻŹÑßÇŒÆČŠŽ ,.'-]{2,72}$/,
    date: /^(\d{4}|\d{1,2})([\-\/\.])(\d{1,2})\2(\d{4}|\d{1,2})$/
};